#include "motor.h"

//-------------------------------------------------------------------------------------------------------------------
//  @brief      电机PWM初始化
//  @param      freq       PWM频率
//				dutyP      前进PWM
//				dutyN      后退PWM
//  Sample usage:           
//		motor_init(200000,0,0); 
//  注意：根据驱动设计要求dutyP与dutyN至少一个为0
//-------------------------------------------------------------------------------------------------------------------
void motor_init(uint32 freq,uint32 dutyP,uint32 dutyN)
{
	pwm_init(MOTOR1_P, freq, dutyP);        //电机控制
	pwm_init(MOTOR1_N, freq, dutyN);     //电机控制
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      电机占空比设置
//  @param      duty     电机PWM波占空比
//  Sample usage:           
//		motor_duty(3000);  //前进 ，占空比为3000/10000
//  注意：duty可能小于0，小于0表示后退
//-------------------------------------------------------------------------------------------------------------------
void motor_duty(int duty)
{
	if(duty<0)
	{
		pwm_duty(MOTOR1_N,-duty);
		pwm_duty(MOTOR1_P,0);
	}
	else
	{
		pwm_duty(MOTOR1_N,0);
		pwm_duty(MOTOR1_P,duty);
	}
}	